# 2019年最新总结，阿里，腾讯，百度，美团，头条等技术面试题目，以及答案，专家出题人分析汇总。
git clone https://github.com/0voice/interview_internal_reference.git

# 中英文敏感词、语言检测、中外手机/电话归属地/运营商查询、名字推断性别、手机号抽取、身份证抽取、邮箱抽取、中日文人名库、中文缩写库、拆字词典、词汇情感值、停用词、反动词表、暴恐词表、繁简体转换、英文模拟中文发音、汪峰歌词生成器、职业名称词库、同义词库、反义词库、否定词库、汽车品牌词库、汽车零件词库、连续英文切割、各种中文词向量、公司名字大全、古诗词库、IT词库、财经词库、成语词库、地名词库、历史名人词库、诗词词库、医学词库、饮食词库、法律词库、汽车词库、动物词库、中文聊天语料、中文谣言数据、百度中文问答数据集、句子相似度匹配算法集合、bert资源、文本生成&摘要相关工具、cocoNLP信息抽取工具、国内电话号码正则匹配、清华大学XLORE:中英文跨语言百科知识图谱、清华大学人工智能技术系列报告、自然语言生成、NLU太难了系列、自动对联数据及机器人、用户名黑名单列表、罪名法务名词及分类模型、微信公众号语料、cs224n深度学习自然语言处理课程、中文手写汉字识别、中文自然语言处理 语料/数据集、变量命名神器、分词语料库+代码、任务型对话英文数据集、ASR 语音数据集 + 基于深度学习的中文语音识别系统、笑声检测器、Microsoft多语言数字/单位/如日期时间识别包、中华新华字典数据库及api(包括常用歇后语、成语、词语和汉字)、文档图谱自动生成、SpaCy 中文模型、Common Voice语音识别数据集新版、神经网络关系抽取、基于bert的命名实体识别、关键词(Keyphrase)抽取包pke、基于医疗领域知识图谱的问答系统、基于依存句法与语义角色标注的事件三元组抽取、依存句法分析4万句高质量标注数据、cnocr：用来做中文OCR的Python3包、中文人物关系知识图谱项目、中文nlp竞赛项目及代码汇总、中文字符数据、speech-aligner: 从“人声语音”及其“语言文本”产生音素级别时间对齐标注的工具、AmpliGraph: 知识图谱表示学习(Python)库：知识图谱概念链接预测、Scattertext 文本可视化(python)、语言/知识表示工具：BERT & ERNIE、中文对比英文自然语言处理NLP的区别综述、Synonyms中文近义词工具包、HarvestText领域自适应文本挖掘工具（新词发现-情感分析-实体链接等）、word2word：(Python)方便易用的多语言词-词对集：62种语言/3,564个多语言对、语音识别语料生成工具：从具有音频/字幕的在线视频创建自动语音识别(ASR)语料库、构建医疗实体识别的模型（包含词典和语料标注）、单文档非监督的关键词抽取、Kashgari中使用gpt-2语言模型、开源的金融投资数据提取工具、文本自动摘要库TextTeaser: 仅支持英文、人民日报语料处理工具集、一些关于自然语言的基本模型、基于14W歌曲知识库的问答尝试--功能包括歌词接龙and已知歌词找歌曲以及歌曲歌手歌词三角关系的问答、基于Siamese bilstm模型的相似句子判定模型并提供训练数据集和测试数据集、用Transformer编解码模型实现的根据Hacker News文章标题自动生成评论、用BERT进行序列标记和文本分类的模板代码、LitBank：NLP数据集——支持自然语言处理和计算人文学科任务的100部带标记英文小说语料、百度开源的基准信息抽取系统、虚假新闻数据集、Facebook: LAMA语言模型分析，提供Transformer-XL/BERT/ELMo/GPT预训练语言模型的统一访问接口、CommonsenseQA：面向常识的英文QA挑战、中文知识图谱资料、数据及工具、各大公司内部里大牛分享的技术文档 PDF 或者 PPT、自然语言生成SQL语句（英文）、中文NLP数据增强（EDA）工具、英文NLP数据增强工具 、基于医药知识图谱的智能问答系统、京东商品知识图谱、基于mongodb存储的军事领域知识图谱问答项目、基于远监督的中文关系抽取、语音情感分析、中文ULMFiT-情感分析-文本分类-语料及模型、一个拍照做题程序、世界各国大规模人名库、一个利用有趣中文语料库 qingyun 训练出来的中文聊天机器人、中文聊天机器人seqGAN、省市区镇行政区划数据带拼音标注、教育行业新闻语料库包含自动文摘功能、开放了对话机器人-知识图谱-语义理解-自然语言处理工具及数据、中文知识图谱：基于百度百科中文页面-抽取三元组信息-构建中文知识图谱、masr: 中文语音识别-提供预训练模型-高识别率、Python音频数据增广库、中文全词覆盖BERT及两份阅读理解数据、ConvLab：开源多域端到端对话系统平台、中文自然语言处理数据集、基于最新版本rasa搭建的对话系统、基于TensorFlow和BERT的管道式实体及关系抽取、一个小型的证券知识图谱/知识库、复盘所有NLP比赛的TOP方案、OpenCLaP：多领域开源中文预训练语言模型仓库、UER：基于不同语料+编码器+目标任务的中文预训练模型仓库、中文自然语言处理向量合集、基于金融-司法领域(兼有闲聊性质)的聊天机器人、g2pC：基于上下文的汉语读音自动标记模块、Zincbase 知识图谱构建工具包、诗歌质量评价/细粒度情感诗歌语料库、快速转化「中文数字」和「阿拉伯数字」、百度知道问答语料库、基于知识图谱的问答系统、jieba_fast 加速版的jieba、正则表达式教程、中文阅读理解数据集、基于BERT等最新语言模型的抽取式摘要提取、Python利用深度学习进行文本摘要的综合指南、知识图谱深度学习相关资料整理、维基大规模平行文本语料、StanfordNLP 0.2.0：纯Python版自然语言处理包、NeuralNLP-NeuralClassifier：腾讯开源深度学习文本分类工具、端到端的封闭域对话系统、中文命名实体识别：NeuroNER vs. BertNER、新闻事件线索抽取、2019年百度的三元组抽取比赛：“科学空间队”源码、基于依存句法的开放域文本知识三元组抽取和知识库构建、中文的GPT2训练代码、ML-NLP - 机器学习(Machine Learning)NLP面试中常考到的知识点和代码实现、nlp4han:中文自然语言处理工具集(断句/分词/词性标注/组块/句法分析/语义分析/NER/N元语法/HMM/代词消解/情感分析/拼写检查、XLM：Facebook的跨语言预训练语言模型、用基于BERT的微调和特征提取方法来进行知识图谱百度百科人物词条属性抽取、中文自然语言处理相关的开放任务-数据集-当前最佳结果、CoupletAI - 基于CNN+Bi-LSTM+Attention 的自动对对联系统、抽象知识图谱、MiningZhiDaoQACorpus - 580万百度知道问答数据挖掘项目、brat rapid annotation tool: 序列标注工具、大规模中文知识图谱数据：1.4亿实体、数据增强在机器翻译及其他nlp任务中的应用及效果、allennlp阅读理解:支持多种数据和模型、PDF表格数据提取工具 、 Graphbrain：AI开源软件库和科研工具，目的是促进自动意义提取和文本理解以及知识的探索和推断、简历自动筛选系统、基于命名实体识别的简历自动摘要、中文语言理解测评基准，包括代表性的数据集&基准模型&语料库&排行榜、树洞 OCR 文字识别 、从包含表格的扫描图片中识别表格和文字、语声迁移、Python口语自然语言处理工具集(英文)、 similarity：相似度计算工具包，java编写、海量中文预训练ALBERT模型 、Transformers 2.0 、基于大规模音频数据集Audioset的音频增强 、Poplar：网页版自然语言标注工具、图片文字去除，可用于漫画翻译 、186种语言的数字叫法库、Amazon发布基于知识的人-人开放领域对话数据集 、中文文本纠错模块代码、繁简体转换 、 Python实现的多种文本可读性评价指标、类似于人名/地名/组织机构名的命名体识别数据集 、东南大学《知识图谱》研究生课程(资料)、. 英文拼写检查库 、 wwsearch是企业微信后台自研的全文检索引擎、CHAMELEON：深度学习新闻推荐系统元架构 、 8篇论文梳理BERT相关模型进展与反思、DocSearch：免费文档搜索引擎、 LIDA：轻量交互式对话标注工具 、aili - the fastest in-memory index in the East 东半球最快并发索引 、知识图谱车音工作项目、自然语言生成资源大全 、中日韩分词库mecab的Python接口库、中文文本摘要/关键词提取、汉字字符特征提取器 (featurizer)，提取汉字的特征（发音特征、字形特征）用做深度学习的特征、中文生成任务基准测评 、中文缩写数据集、中文任务基准测评 - 代表性的数据集-基准(预训练)模型-语料库-baseline-工具包-排行榜、PySS3：面向可解释AI的SS3文本分类器机器可视化工具 、中文NLP数据集列表、COPE - 格律诗编辑程序、doccano：基于网页的开源协同多语言文本标注工具 、PreNLP：自然语言预处理库、简单的简历解析器，用来从简历中提取关键信息、用于中文闲聊的GPT2模型：GPT2-chitchat、基于检索聊天机器人多轮响应选择相关资源列表(Leaderboards、Datasets、Papers)、(Colab)抽象文本摘要实现集锦(教程 、词语拼音数据、高效模糊搜索工具、NLP数据增广资源集、微软对话机器人框架 、 GitHub Typo Corpus：大规模GitHub多语言拼写错误/语法错误数据集、TextCluster：短文本聚类预处理模块 Short text cluster、面向语音识别的中文文本规范化、BLINK：最先进的实体链接库、BertPunc：基于BERT的最先进标点修复模型、Tokenizer：快速、可定制的文本词条化库、中文语言理解测评基准，包括代表性的数据集、基准(预训练)模型、语料库、排行榜、spaCy 医学文本挖掘与信息提取 、 NLP任务示例项目代码集、 python拼写检查库、chatbot-list - 行业内关于智能客服、聊天机器人的应用和架构、算法分享和介绍、语音质量评价指标(MOSNet, BSSEval, STOI, PESQ, SRMR)、 用138GB语料训练的法文RoBERTa预训练语言模型 、BERT-NER-Pytorch：三种不同模式的BERT中文NER实验、无道词典 - 有道词典的命令行版本，支持英汉互查和在线查询、2019年NLP亮点回顾、 Chinese medical dialogue data 中文医疗对话数据集 、最好的汉字数字(中文数字)-阿拉伯数字转换工具、 基于百科知识库的中文词语多词义/义项获取与特定句子词语语义消歧、awesome-nlp-sentiment-analysis - 情感分析、情绪原因识别、评价对象和评价词抽取、LineFlow：面向所有深度学习框架的NLP数据高效加载器、中文医学NLP公开资源整理 、MedQuAD：(英文)医学问答数据集、将自然语言数字串解析转换为整数和浮点数、Transfer Learning in Natural Language Processing (NLP) 、面向语音识别的中文/英文发音辞典、Tokenizers：注重性能与多功能性的最先进分词器、CLUENER 细粒度命名实体识别 Fine Grained Named Entity Recognition、 基于BERT的中文命名实体识别、中文谣言数据库、NLP数据集/基准任务大列表、nlp相关的一些论文及代码, 包括主题模型、词向量(Word Embedding)、命名实体识别(NER)、文本分类(Text Classificatin)、文本生成(Text Generation)、文本相似性(Text Similarity)计算等，涉及到各种与nlp相关的算法，基于keras和tensorflow 、Python文本挖掘/NLP实战示例、 Blackstone：面向非结构化法律文本的spaCy pipeline和NLP模型通过同义词替换实现文本“变脸” 、中文 预训练 ELECTREA 模型: 基于对抗学习 pretrain Chinese Model 、albert-chinese-ner - 用预训练语言模型ALBERT做中文NER 、基于GPT2的特定主题文本生成/文本增广、开源预训练语言模型合集、多语言句向量包、编码、标记和实现：一种可控高效的文本生成方法、 英文脏话大列表 、attnvis：GPT2、BERT等transformer语言模型注意力交互可视化、CoVoST：Facebook发布的多语种语音-文本翻译语料库，包括11种语言(法语、德语、荷兰语、俄语、西班牙语、意大利语、土耳其语、波斯语、瑞典语、蒙古语和中文)的语音、文字转录及英文译文、Jiagu自然语言处理工具 - 以BiLSTM等模型为基础，提供知识图谱关系抽取 中文分词 词性标注 命名实体识别 情感分析 新词发现 关键词 文本摘要 文本聚类等功能、用unet实现对文档表格的自动检测，表格重建、NLP事件提取文献资源列表 、 金融领域自然语言处理研究资源大列表、CLUEDatasetSearch - 中英文NLP数据集：搜索所有中文NLP数据集，附常用英文NLP数据集 、medical_NER - 中文医学知识图谱命名实体识别 、(哈佛)讲因果推理的免费书、知识图谱相关学习资料/数据集/工具资源大列表、Forte：灵活强大的自然语言处理pipeline工具集 、Python字符串相似性算法库、PyLaia：面向手写文档分析的深度学习工具包、TextFooler：针对文本分类/推理的对抗文本生成模块、Haystack：灵活、强大的可扩展问答(QA)框架、中文关键短语抽取工具
git clone https://github.com/fighting41love/funNLP.git

# 面试题
git clone https://github.com/leeguandong/Interview-code-practice-python.git

# 《剑指Offer》面试题Python实现
git clone https://github.com/JushuangQiao/Python-Offer.git

# 2018/2019/校招/春招/秋招/自然语言处理(NLP)/深度学习(Deep Learning)/机器学习(Machine Learning)/C/C++/Python/面试笔记，此外，还包括创建者看到的所有机器学习/深度学习面经中的问题。 除了其中 DL/ML 相关的，其他与算法岗相关的计算机知识也会记录。 但是不会包括如前端/测试/JAVA/Android等岗位中有关的问题。
git clone https://github.com/DarLiner/Algorithm_Interview_Notes-Chinese.git

# Leetcode、剑指Offer——名企面试官精讲典型编程题
git clone https://github.com/nlpjoe/Coding4Interviews.git

# 面试总结
git clone https://github.com/sushengbuhuo/php-interview-2018.git

# 互联网行业研发岗面试必备算法题配图解析及代码
git clone https://github.com/DmrfCoder/AlgorithmAndDataStructure.git

# 工程师的自我修养 -> 从 linux , 网络，MQ, Rpc, 缓存, 高可用架构，数据库，语言，全方位成长，成为技术大神，优秀的工程师 , readme 包括蚂蚁, 头条, 美团等面试思考( 拿下 offer)
git clone https://github.com/yuhaqiang123/my-love.git

# 基于 python 的 selenium UI 自动化测试框架，采用 Page Object 设计模式进行二次开发，通过对页面对象和测试代码进行分离，并封装了日志输出，浏览器引擎选择，二次封装常用方法。降低后期因页面变化带来的维护成本，减少了代码的重复，提高测试用例的可读性
git clone https://github.com/StrawberryFlavor/Selenium-Framework.git

# 针对常见的BAT公司中的大数据面试和笔试问题，列出解决思路，并使用python来实现
git clone https://github.com/yoghurtjia/-python-BAT-.git

# 这个是自己日常改写和积累的python资料：本次资料提供大量的python面试的准备资料，包括常用的python版本代码段、python网络编程的各个部分的实现方式、python版本的设计模式、以及最最会考的令人头痛的算法问题（python版本）
git clone https://github.com/imtiantian/Python_Awesome_Interview.git

# Just  Code ! 针对面试训练算法题， 目前包括字节跳动面试题、 LeetCode 和剑指 offer ，持续扩容中 :star:
git clone https://github.com/YaxeZhang/Just-Code.git

# 经典算法&面试题的源代码实现项目
git clone https://github.com/wuchong/Algorithm-Interview.git

# python 数据结构 算法 LeetCode 牛客 面试 编程之美 动态规划 字典树 快速排序 树 字符串 数组 链表 全排列 堆排序 位运算 大数相加
git clone https://github.com/whtlkeep/BAT-algorithms.git

# 整理自己准备面试时的相关资料，包括 GitBook、Python、C/C++ 等代码及知识点
git clone https://github.com/L1nwatch/interview_collect.git

# 面试常见问题总结
git clone https://github.com/LEAGUE-OF-BME/InterviewFAQ.git

# 基于Selenium+unittest的WebUI自动化测试框架，使用POM(页面对象模型)设计模式，适合几乎所有web项目，可集成Jenkins部署自动化测试
git clone https://github.com/G2Bent/Vantpy.git

# 后端面试题汇总（Python、Redis、MySQL、PostgreSQL、Kafka、数据结构、算法、编程、网络）
git clone https://github.com/yongxinz/back-end-interview.git

# 面试准备
git clone https://github.com/IcyCC/effective_note.git

# LeetCode Java Algorithm 记录数据结构与算法训练题，分享java面试题
git clone https://github.com/geektutu/leetcode-java.git

# 此项目是《剑指offer》第二版里算法面试题的Python3实现版本，作为一本经典书籍，可以时常拿出来看一看、翻一翻、记一记。同时也是为了Python程序员能够更好的通过公司的技术面试，拿到心仪的offer。
git clone https://github.com/NLP-LOVE/CodingInterviews2-ByPython.git

# 一个微信图形界面调试工具，免去你将程序部署到服务器的麻烦。
git clone https://github.com/winkidney/wei-dev.git

# This repo is the sample code of online vedio class “高频算法面试精讲”
git clone https://github.com/chlxydl/Algorithm_Class_Problem_Sample_Code.git

# 双目立体视觉是计算机视觉范畴的核心之一，它利用双目相机来获得目标物体的图像，经过物体图像处理 之后得到目标物体所在场景环境的三维信息，最终实现非接触条件下测距，简单便捷。本次毕业设计主要内容为研究 基于双目立体视觉平台上的图像匹配以及目标物体的距离测量技术，图像特征提取部分研究了 SIFT 算法和 SURF 算 法，特征匹配部分研究了 BF 法和 FLANN 法，距离测量研究主要通过视差深度的计算，结合视觉坐标系的转换实现 三维位置的定位与测量。结合维视双目立体视觉测量平台 MV-VS220，通过 Python+OpenCV 设计实现一个具备图像 采集、图像匹配以及距离测量等功能的原型演示系统。系统可实现对关键环节的过程与结果的演示，以及不同算法的 性能比较。系统测试表明，所开发的原型演示系统从界面、功能与性能方面均达到了设计的要求。
git clone https://github.com/Cuirongcheng/Image-matching-and-ranging-based-on-binocular-stereo-vision.git

# 定位综述 目前用于人脸定位的有两种主流方法，一种是基于级联形状回归模型，另一种就是基于深度学习的方法。级联形状回归方法就是使用回归模型，直接学习从人脸表征到人脸形状的映射函数，进而建立从表观到形状的对应关系。这种方法的学习依赖于训练集的选取，如果训练集中包含了复杂的姿态变化，学习到的函数测试性能就会比较好。现有很多基于回归的方法，其中比较突出的有颜水成的DCR（Deep Cascaded Regression）、ESR（Explicitly Shape Regression）方法、LBF（Local Binary Features）方法以及SDM（Supervised Decent Method）方法。但是，上述方法也存在一定的问题，例如，基于提取到的局部图像特征来定位时很难找到具有全局信息的关键点。基于点分布模型的方法和基于形状回归的方法都很依赖于初始值，其中，初始值通常由训练集的平均形状来给定，如果初始值或者设定的平均形状远远偏离目标位置，很难收敛到正确位置。比如，训练集中大部分都是正脸，那么对于测试集中大偏转角度人脸图像的定位就比较困难。 于是引入深度学习来解决较大面部偏转姿态的回归问题，深度学习的最大的优点是有强大的表达能力，可以自学习图像的特征，不需要人为的寻找特征。目前用的基本网络有（1）级联方式：由粗到精一级一级的优化前一步得到的形状，比如香港中文大学汤晓鸥老师的研究团队采用深度卷积神经网络的3个级联结构，逐步细化特征点位置。（2）沙漏网络：密集堆叠连接的U-Nets来进行人脸关键点定位，如CU-Nets通过卷积-反卷积，下采样与上采样网络，跨越不同U-Nets进行全局梯度传播，融合多尺度特征，不断迭代优化关键点坐标。但是深度学习方法的缺点是模型过于复杂，参数非常多，耗时比较长。 深度学习的国内外方法优化：（1）最早的有将人脸进行五官分区域定位回归，但很容易使最终结果陷入局部最优值而不是全局最优。（2）heatmap热图的方法，对数据标签进行处理生成高斯热图，从而更好的回归关键点位置。（3）风格聚合方法，对数据集进行处理生成不同风格的图片，以应对复杂的真实环境如光照强弱。（4）基于边缘感知的人脸关键点检测算法，首先通过消息传递并结合对抗学习得到高精度的边缘线检测结果，再将边缘线信息融合到关键点检测中，来提升算法在大侧脸、夸张表情、遮挡、模糊等极端情况下的鲁棒性。（5）3D人脸模型方法，一种方式是结合3D人脸姿态估计与投影来确定特征点初始位置，然后使用经典的回归树集成ERT方法来更好的进行位置回归；另一种是直接从单幅人脸图像中同时回归出3D人脸结构和密集对齐点；该类方法通过回归位置图，来获得3D几何以及语义信息。（6）人脸特征点检测与形状拟合方法，基于“特征提取”+“回归坐标”的方法，把形状拟合的坐标回归问题，转化为坐标PCA压缩后系数与形状整体仿射变换系数的回归问题（相当于将传统的SDM算法用于深度学习算法当中）。 目前定位方法的改进是： 1.基于深度学习的方法：改进如下： （1）受人体关键点定位 难例挖掘方法的启发，在全局的globalnet之后继续对损失较大的点继续进行微调。 （2）并行集成的方式同时训练两个网络globalnet、refinenet，测试时，第一个网络输出的l2 loss 取top k  loss作为refinenet的辅助损失继续微调回归关键点位置。（在300w 有缺失块的数据集上最终的测试结果，平均定位误差为5.9%）  300-W数据库： 68点定位库，包含4个数据集，比如AFW，LFPW，HELLE，还包含135张IBUG里面的图片，IBUG图片对于定位来说都是非常具有挑战性的，不管是旋转角度还是遮挡程度都是非常大的。我们用HELEN的2000张，LFPW的811张，AFW的337张，总共3148张图片作为训练集。用HELEN的554张，IBUG的135张图片，总共689张图片作为测试集。一般测试集分为3个标准：简单，有挑战，全集。简单的测试集就是前面554张图片，有挑战的就是后面那135张图片，全集即689张图片。对三个测试集分别测试，得出测试结果，并与其它方法进行比较。测试标准为定位的平均误差，是被双瞳孔距离归一化后的，平均误差越低代表这一算法越好。
git clone https://github.com/1365843167/-.git

# 2018/2019/校招/春招/秋招/算法/机器学习(Machine Learning)/深度学习(Deep Learning)/自然语言处理(NLP)/C/C++/Python/面试笔记
git clone https://github.com/DiHiera/Algorithm_Interview_Notes-Chinese-master.git

# Python Web 开发面试过程中的知识点总结
git clone https://github.com/MorsoLi/python-interview-guide.git

# 《Python程序员面试算法宝典》配套代码
git clone https://github.com/Yasin6/Programmer-Algorithm-Interview.git

# 算法面试题用的，都是iMac里的内容
git clone https://github.com/sindwerra/Algorithms.git

# 针对不定长的验证码使用ctc_loss+lstm进行训练，然后在测试集合上面进行测试
git clone https://github.com/Tangzixia/tensorflow_captcha_lstm_ctc_loss.git

# 程序员代码面试指南（左程云 著） 的python代码实现版本，原书使用的是java版本
git clone https://github.com/luserv/code_guide_for_programmer_interview.git

# 剑指Offer（第二版）/程序员代码面试指南（第2版）/LeetCode/LintCode
git clone https://github.com/BluesChang/Algorithms.git

# 1,huaproject算福利吧,爬取的中国校花网,并且保存到本地,基础知识点,url,json,文件的读写.  2,Document.doc 是自己总结的常见爬虫面试题以及答案,但是貌似不想做全职爬虫,所以可能以后也不会更新这一块,爬虫算乐趣, 以后估计重心会放在web  3.weibo_login 是用 selenium控制PhantomJS登录微博,获取cookie,然后为所欲为
git clone https://github.com/dagege1993/scrapy.git

# Android功能测试过程所用到的adb命令操作，通过python编程方式，采用wxpython和easygui第三方库，实现为一个可视化的桌面操作工具，提供快捷方便测试操作。
git clone https://github.com/gitjayzhen/ApkInstallTool.git

# 使用Python3 csv模块处理快收后台导出的商场优惠活动交易数据，统计各类优惠券的核销数量，以及实收款等汇总数据。测试数据 "1. 财务明细数据.csv" 已经删除了敏感信息，由于客户不想使用脚本，所以使用 PyQt5 编写了图形界面，再使用 pyinstaller 打包为可执行程序
git clone https://github.com/wangy8961/python3-pyqt5-process-csv-data.git

# k2p新ui页面自动化测试
git clone https://github.com/niununu/k2p_web_test.git

# 整理一个iOS Objective-C面试题，也就是把基础知识回顾一遍。一个普通iOS能做的就是一点点的积累。
git clone https://github.com/lionsom/XiOS.git

# 架构，资深程序专家面试题
git clone https://github.com/yky138495/awesome-Interview.git

# 题库（单选+多选+判断）.xlsx  本题库中单选520题，多选256题，判断题363题。  现在需要从题库随机选择20题单选题，10题多选题，10题判断题，生成1份测试考试试卷（本程序实现生成10份试卷和答案卷）。  本程序采用Tkinter做GUI界面，选择对应的题库路径。  采用openpyxl模块读取Excel的.xlsx后缀文件并处理数据，用docx模块实现Word试卷的生成。  采用random模块生成随机数，用set做容器，以排除两次随机数生成相同。  最后采用pyinstaller模块对程序进行编译生成.exe文件。在CMD中输入：pyinstaller -Fw  G:\TEST.py，生成TEST.exe文件
git clone https://github.com/wukai0909/Generating-WORD-Test-Papers-from-Excel-Question-Bank.git

# [DEPRECTED]知道创宇校招面试题
git clone https://github.com/shellvon/KnownSec-Interview.git

# 一个简单的CTF测试平台，做培训上用，目前没有做相关安全方面的策略，不要部署到线上
git clone https://github.com/w2n1ck/ASCTF-platform.git

# Python面试常见的170道题目的解析和源码
git clone https://github.com/PythonerKK/python-interview-questions.git

# 面试题python版
git clone https://github.com/xzjs/interview_python.git

# 基于python编写的selenium自动化测试框架，采用PO模式，页面元素采用yaml进行管理
git clone https://github.com/yangweimin888/SeleniumPython.git

# Python简单习题的代码演示，可能有部分是面试题噢
git clone https://github.com/cassieeric/Python-Exercises_Interview_questions.git

# 天天生鲜项目是在网上找到的“黑马培训”机构的一个生鲜电商购物网站。看了各种文档介绍说，里面用到的技术面比较广，同时网上还有视频、文档教程， 所以就自己尝试做了。里面涉及到了分布式文件系统--FastDFS结合nginx作为项目中的图片服务器、使用redis作为购物车功能、接入支付宝等第三方支付的 接口等……同时在代码方面的简化、数据库模型的设计让我在对于Django网站开发受益匪浅。
git clone https://github.com/iddlee/dailyfresh.git

# 这是一个针对测试工作的一个工具集合，包含了手机appium工具的使用、网页selenium的使用、接口requests工具的使用；这是一个整合，想让owl@ override  the world limit 能够跨越各工具的隔阂。整个框架的思量性很杂，可以定义为python与测试理论结合的进阶性学习成果。它还还可以进一步完善，实现界面化，及更优秀的想法注入。比如：性能、爬虫...
git clone https://github.com/gitjayzhen/python-owl.git

# 面试题
git clone https://github.com/yaolong3/interview.git

# 该项目是关于如何设计大型系统，以及如何应对系统设计面试。系统设计是一个很宽泛的话题。在互联网上，关于系统设计原则的资源也是多如牛毛。这个仓库就是这些资源的组织收集，它可以帮助你学习如何构建可扩展的系统。
git clone https://github.com/DarLiner/system-design-primer.git

# 自动化测试用例web管理页面
git clone https://github.com/RainYang0925/testcase_web.git

# 刚好准备面试、随便整理一下面试题
git clone https://github.com/jiangzhonglian/AlgorithmSort.git

# Intel的面试
git clone https://github.com/duzhen1996/TensorFlow-Intel-Interview.git

# UItestframework项目目前具有以下功能： 1，对webdriver进行了第二次的简单封装，使用更加方便public / common / pyselenium.py  （ps：这个是在虫师的pyse基础加了打印日志功能，参考：https ：//github.com/defnngj/pyse)  2，可以对excel表进行数据读取，完成数据驱动：public / common / datainfo.py  3，具有打印日志的功能，打印在控制台和文件中：public /common/log.py,日志保存在report / log /目录下 4，读取配置文件（.ini文件）：public / common / readconfig.py  5，具有发邮件的功能：public / common / sendmail.py  6，生成测试报告：html测试报告的路径：report / testreport /目录下 7，使用了PageObject模式来编写测试脚本  整个项目的目录结构： ├─config配置文件的目录 ││config.ini存放配置文件 │ │globalparam.py重要的全局参数，如日志，报告路径的配置等 展示│展示│的__init__.py  展示│展示│  展示│  ├─data数据测试 展示│├─formaldata＃环境正式数据测试 展示│└ TESTDATA＃测试环境的数据 │searKey.xlsx  │  ├─public的公共库文件 ││的__init__.py  ││  │├─common的封装公共方法 │││basepage.py  │││datainfo.py  │││log.py  │││mytest的。 PY  │││publicfunction.py  │││pyselenium.py  │││pyselenium20161107.py  │││readconfig.py  │││sendmail.py  │││的__init__.py  │││  ││  │├─pages使用pageobject模式编写测试脚本，存放页目录的 展示│展示│展示│baiduInde​​xPage.py  展示│展示│展示│的__init__.py  展示│  ├─report报告扩展测试 展示│├─image目录应用说明教学 展示│├─log目录日志 展示│展示│2016-11-07.log  展示│展示│  展示│└ ─testreporthtml测试报告目录 │TestResult2016-11-07_16_15_51.html  │  └─testcase测试用例存放     │test_baidu.py   使用说明： 安装响应的库：画中画安装xlrd，硒，configparser  1，在的config.ini中配置项目路径：project_path  2，测试数据放在数据目录下面 3，使用pageobject，写页页面，在测试用例里面调用放在公共/页目录下 4，在测试用例目录下面，编写测试用例，可以分模块编写，建相应的目录 5，执行运行的.py，就可以执行所有的测试用例 6，在报告/日志里面查看日志 7，在报告/ testreport里面查看HTML报告扩展测试  关于pyselenium的使用： 该PY文件是根据虫师的pyse改的，加了一个日志，自己根据需要的加了几个函数 可以参考虫师的pyse，github上地址：HTTPS：//github.com/defnngj/pyse  虫师的博客园地址：HTTPS：//github.com/defnngj/pyse   导入PySlenium文件 导入PySelenium  1，启动浏览器： 启动谷歌浏览器 dr = PySelenium.PySelenium（'chrom'） 启动远程浏览器比如使用网格施行分布式执行 dr = PySelenium.PySelenium（RChrome'，'127.0.0.1：8080'）2  ，在地址栏输入网址： dr.open（'http://www.baidu.com “） 3，窗口最大化 dr.max_window（） 4，设置浏览器的窗口的大小 dr.set_window（800500） 如图5所示，不清除文本框的内容直接输入值（比如说：进行文件上传时，上传文件的路径，如果清除就会报错）： dr.type（'id-> su'，'小石头测试仪'） 6，先清除文本框的内容，然后再输入值（用得很多）： dr.clear_type（' name-> su'，'虫师'） 7，直接点击元素 dr.click（'css  - >  #kw '）8，右键点击元素： dr.right_click（'id-> kw'） 9，将鼠标移动到一个元素上 dr.move_to_element（'clas-> btn1.btn-green.btn-search'） 10，双击元素 dr.double_click（“id-> kw”） 11，将一个元素拖拽到另外一个元素上 dr.drag_and_drop（”ID-> KW1' ， 'ID  - > KW2'） 12，根据连接的文字来点击（<a href="http://www.baidu.com">百度</a>） dr.click_text（'百度'） 13，关闭窗口，驱动程序 dr.quit（） 14，执行js  脚本dr.js（'script'） 15，获取元素的属性 dr.get_attribute（“id-> su”，“href”） 16，获取元素的文本信息文本 dr.get_text（'id-> su'） 17，返回当前页面的标题 dr.get_title（） 18，返回当前页面的url  dr.get_url（） 20，进入帧 dr.switch_to_frame（'id-> kw'） 21，退出帧 dr.switch_to_frame_out（ ） 22，判断元素是否存在 dr.element_exist（ 'ID->千瓦'） 23，截图 dr.take_screenshot（ 'FILE_PATH'） 24，进入最新的表 dr.into_new_window（） 25，输入内容并且回车 博士。type_and_enter（'id-> kw'）  26，使用js来点击某个元素 dr.js_click（'id-> kw'） 27，返回原生的webdriver，进行个性化需求 dr.origin_driver（）
git clone https://github.com/joinsum/UItestframework.git

# Python 面试知识整理(个人查漏补缺，不稳定更新).
git clone https://github.com/XiangHuang1992/python_interview.git

# 性能测试平台-服务和页面监控
git clone https://github.com/fanstein/PTest.git

# 自己玩osu和太鼓次郎时谱面进行转换的一个小工具，写得相当之乱，只管能用，最近要小修改一下正好试用一下GitHub。
git clone https://github.com/delguoqing/osu2tja.git

# iOS 面试题收集，会给出参考答案
git clone https://github.com/yangminiOS/interview_question.git

# 知道创宇后端面试题：爬虫
git clone https://github.com/g10guang/interviewSpider.git

# 查猪面试题搜索引擎后台---使用Django框架提供接口
git clone https://github.com/coco369/answer_django.git

# 使用wxFormBuilder.exe设计界面，并使用wxpython库开发一个Python图形界面程序。该程序可用于进行HTTP接口测试，构建HTTP请求消息，得到响应结果。
git clone https://github.com/liumengjia/InterfaceTestTool.git

# 🪐基于自动人脸分析的“智能面瘫诊断助手”，机器学习项目✔，采集人脸数据诊断面瘫等级🗡，微信小程序测试中⌛
git clone https://github.com/GatesMa/DiagnoseSCU.git

# 开始尝试面部识别的小代码，此代码本意是将女友照片自动缩放贴到本人照片眼睛处，表达“我的眼里只有你”
git clone https://github.com/pengfexue2/Eye.git

# 面试题
git clone https://github.com/sy159/interview.git

# 《剑指Offer》中面试题的Python实现
git clone https://github.com/kabutohui/ChineseCodingInterviewByPython.git

# Leetcode/剑指offer/笔试面试题/数据结构，python3/C++
git clone https://github.com/SuyuanLiu/Algorithm.git

# 百度的面试题目python版本
git clone https://github.com/linpan/python_internPractice.git

# :smiley::smiley:关于Python开发的一系列面试要领以及专题
git clone https://github.com/lateautumn4lin/Python_Development_Interview.git

# 用python实现剑指offer等python面试编程题（写着玩）
git clone https://github.com/yanhuangxiaoguang/offer-python.git

# 2019年最新总结，阿里，腾讯，百度，美团，头条等技术面试题目，以及答案，专家出题人分析汇总。
git clone https://github.com/oneoy/InterviewHR.git

# 剑指offer 第二版(2-66题) & 程序员代码面试指南(1-2章) python实现
git clone https://github.com/JiaxingZhao/Leetcode-Algorithm.git

# 2019年最新总结，阿里，腾讯，百度，美团，头条等技术面试题目，以及答案，专家出题人分析汇总。
git clone https://github.com/FightForBigData/interview_internal_reference.git

# 本项目是利用深度学习技术来构建知识图谱方向上的一次尝试，作为开放领域的关系抽取，算是笔者的一次创新，目前在这方面的文章和项目都很少。
git clone https://github.com/percent4/spo_extract_platform.git

# 考虑到工作开始慢慢接触spark生态，学习下Spark，PySpark功能，尝试使用PySpark，将Kaggle，DataCastle，TianChi，JData，Kesci，ppd，AiChallenger上面一些高质量比赛的参赛者分享的基于Pandas和Ligthtgbm的top方案，用PySpark和LightGBM on Apache Spark来进行复现，一方面熟悉相关包的功能和接口，一方面也了解top选手的一些数据挖掘、分析的思路和套路，trick等等，工作以后能刷比赛的时间实在太少了，如果有自己参加比赛成绩较好的，也会尝试复现。包含：IEEE-CIS Fraud Detection
git clone https://github.com/AiIsBetter/PySpark_Kaggle_DataCastle_TianChi_JData_Kesci_ppd_AiChallenger.git

# 🍋 Python基础、Pygame游戏编程、Python算法与面试题、四种常用的Python Web框架、爬虫、数据可视化、机器学习。一共七个Python大方向！
git clone https://github.com/fmw666/Python.git

# 基于appium的页面元素遍历测试（开发中）
git clone https://github.com/liyuanhong/clickAllElements.git

# 面试题
git clone https://github.com/JunJun-Love-Amber/job-for-xkool.git

# Python面试题专栏
git clone https://github.com/miraclestatus/Python-interview-project.git

# 饿了吗面试题
git clone https://github.com/WangErGou/ele_interview.git

# 面试相关技能
git clone https://github.com/litchi-zdd/pangdan.git

# 关于一些面试的文章
git clone https://github.com/liangsenzhi/Interview.git

# python程序员面试宝典
git clone https://github.com/Willianan/Interview_Book.git

# Python常见面试题总结
git clone https://github.com/liweisunny/InterviewQuestions.git

# 面试中一些算法题总结
git clone https://github.com/shawroad/Algorithm.git

# web页面自动化测试框架
git clone https://github.com/Eric130vv/vv_web_framework.git

# 日常积累／面试题库
git clone https://github.com/Gwindfan/useful-experience.git

# 程序员代码面试指南
git clone https://github.com/gmaclinuxer/flush_me.git

# 这是python的面试题集合
git clone https://github.com/yingkun1/python_test.git

# 《剑指Offer》面试题练习
git clone https://github.com/charseki/JianZhi_Offer.git

# 某公司面试用的，学习使用flask做个blog
git clone https://github.com/bigfang/flask-blog.git

# 解决社团面试中时间安排的问题
git clone https://github.com/fky2015/interview-schedule.git

# 面试准备，求给我一个OFFER吧！
git clone https://github.com/JeffWang1994/Intern_ML.git

# 某公司面试用的，学习使用flask做个blog
git clone https://github.com/bigfang/flask-blog.git

# 这是电脑桌面app自动化测试脚本
git clone https://github.com/qichengzeng/windows_auto.git

# 面试刷题：LeetCode, 剑指offer等-用Python语言实现
git clone https://github.com/hitergelei/Algorithms.git

# 常见程序员面试题的python实现
git clone https://github.com/pypot/interview_pot.git

# 广东考试局重启云桌面程序
git clone https://github.com/Timbaland8888/ddc.git

# 刷题、面试、实习、工作经验总结
git clone https://github.com/luciusun/LearnPython.git

# 关于python的面试题及leetcode题目代码实现
git clone https://github.com/Niracler/python-exercise.git

# 主要用于存放面试相关的内容
git clone https://github.com/Jackson-AndyLau/Interview_package.git

# 开发一个带GUI界面的测试数据生成工具。
git clone https://github.com/kongyanfei/test_data.git

# 整理汇总机器学习面试问题与学习脉络
git clone https://github.com/xinghalo/ml-interview.git

# 基于python tkinter开发的一款monkey测试工具，可视化的交互界面，方便测试者傻瓜式操作。
git clone https://github.com/Botreechan/monkey_tools.git

# 算法与数据结构，包括剑指offer、程序员代码面试指南、LeetCode等
git clone https://github.com/yaozhu008/Algorithm.git

# python爬虫测试程序爬取新浪wap页面. A python crawler test demo that crawls the Sina Weibo WAP pages
git clone https://github.com/wwwhackcom/weibo_wap.git

# 汇集了一些公司的面试算法真题，使用python实现！博客地址：https://blog.csdn.net/zzzzlei123123123
git clone https://github.com/zlhcsm/python_algorithm.git

# 设备稳定性测试，自动记录log，日志每天切分，UI界面
git clone https://github.com/maiyajj/UI_stability_test_serial.git

# 将一道简单的面试题，按照项目工程的目录结构组织实现
git clone https://github.com/lxl0928/tuo_tian_su_dai.git

# Kaggle上入门比赛以及一道云客公司的机器学习面试题
git clone https://github.com/TrustMe5/GameKaggle.git

# 学习python语言并写一个卸载mac上面程序，主要考虑网上好多卸载程序都只能试用一个月很不方便
git clone https://github.com/david122886/UninstallMacApp.git

# Python面试复习知识点，包括数据结构算法，操作系统，计算机网络，数据库，设计模式等
git clone https://github.com/ChangAn223/Python-Interview.git

# 这是一道考题：据说是各大科技公司（google,amazon,facebook）的面试以及用来培训高级程序员的题目
git clone https://github.com/zhuangchuming/array2group.git

# Coding interview in python3 - - We care about coding style here ! 白板编程面试模板代码，保证Coding Style前提下，最短最高效
git clone https://github.com/grg909/LCtrip.git

# 兼容性+100 初装难度+1 被图形化界面的一键修改dnf台服服务端ip坑惨了的朋友们不要慌 试试这个！
git clone https://github.com/kennedy-han/onekeyIP.py.git

# 用于一个大数据量测试，实例使用四张表，模拟30万终端用户设备，3万路由器设备，3000个用户；每个用户有10台路由器，一个路由器下面挂接10台终端设备
git clone https://github.com/shichaowei/mysql.git

# 2019年最新总结，阿里，腾讯，百度，美团，头条等技术面试题目，以及答案，专家出题人分析汇总。持续更新中。
git clone https://github.com/williejoker/2019-.git

# 一个Tensorflow库，里面包含 使用TensorFlow 构建的模型和示例的教程，旨在更好的维护，测试，并与最新的TensorFlow API保持同步最新。
git clone https://github.com/DarLiner/models.git

# 这个项目是导师的某一个需求，导师打算从三万份文书中找出每一份文书中的被告、原告、借款金额、还款数量、被告和原告的数量，但是这些文书里面很杂乱，文书内容也很乱，这个文件是关于对这些东西进行模式识别的尝试，结果还不错
git clone https://github.com/caiyunbin/yongkangwenshu.git

# 爱玩特面试编程能力测试结果提交
git clone https://github.com/HonorIpaddr/AInvest_interview.git

# 面试
git clone https://github.com/yangyixuan-tom/interview3.15.git

# 面试
git clone https://github.com/Handy521/interview-code.git

# 面试
git clone https://github.com/githubtianfeng/interview-project.git

# 面试
git clone https://github.com/xhrjdzw/360.git

# 面试
git clone https://github.com/xiaobaoxia/rename_dcm.git

# 面试代码
git clone https://github.com/djm756885994/-.git

# 面试题目
git clone https://github.com/wanghaininggg/msbd.git

# 面试准备
git clone https://github.com/daigjSheild/ForInterview.git

# 面试题
git clone https://github.com/Homnis/mianshi.git

# 面试题
git clone https://github.com/tmomy/pyleetcode.git

# 面试题
git clone https://github.com/victor9309/tornado_test.git

# 面试题
git clone https://github.com/fengguoquan/InterviewTests.git

# 测试页面
git clone https://github.com/l985654987/text01.git

# python面试题
git clone https://github.com/daisyzl/program-exercise-python.git

# python面试题
git clone https://github.com/Abel-Fan/python_interview_question1.git

# 面试题
git clone https://github.com/Melonseedk/Result.git

# python面试题
git clone https://github.com/Z-JERD/interview_question.git

# 面试题
git clone https://github.com/Sunnyhp/City-Solitaire.git

# 面试资料
git clone https://github.com/lemon0620/Interview-code-practice-python.git

# 面试题
git clone https://github.com/YangLiuye-Leon/-.git

# python面试题
git clone https://github.com/vevoly/PythonInterviewQuestions.git

# 算法面试
git clone https://github.com/xiaolinzi-xl/Algorithm-Interview-Study.git

# Eigen面试题
git clone https://github.com/tedchengy/Eigen.git

# 面试题
git clone https://github.com/m2kar/code_interview.git

# 有关面试
git clone https://github.com/syntomic/interview.git

# 笔试面试备考
git clone https://github.com/joyride-bin/algorithm.git

# 一个面试测试
git clone https://github.com/lvshaoyuan/test.git

# 面试算法类
git clone https://github.com/lshupingxl/Algorithm.git

# LeetCode 面试必备
git clone https://github.com/cbxs123/LeetCode.git

# Sohu 的面试题！
git clone https://github.com/WangErGou/sohu_interview.git

# 提交面试题
git clone https://github.com/fsxchen/InterviewCommit.git

# 面试Soho所用
git clone https://github.com/1oscar/Soho_test.git

# 提交面试题
git clone https://github.com/fsxchen/InterviewCommit.git

# 面试算法等
git clone https://github.com/wangpengxia/InterviewProject.git

# 骚窝面试题
git clone https://github.com/children1987/cash_register.git

# py面试总结
git clone https://github.com/fjqp/python-review.git

# python面试题库
git clone https://github.com/wuzhenbin/python-question-store.git

# 面试编程题
git clone https://github.com/happyAnger6/interview_subjects.git

# Sohu 的面试题！
git clone https://github.com/WangErGou/sohu_interview.git

# 搜狐面试题
git clone https://github.com/masterpy/main.py.git

# LeetCode 面试必备
git clone https://github.com/cbxs123/LeetCode.git

# 一道面试题
git clone https://github.com/PhilHua/city_chain_game.git

# 面试题大全
git clone https://github.com/wangchunming/-.git

# python面试题目
git clone https://github.com/zhm721/python_interview-questions.git

# web页面UI自动化测试--基于selenium工具python实现【python2.7】
git clone https://github.com/gitgogo/uiauto_test_web_python.git

# 笔试、面试算法汇总
git clone https://github.com/blueberryc/Review-Algorithm.git

# 110道python面试题
git clone https://github.com/shangkh/github_python_interview_question.git

# Python 算法面试题
git clone https://github.com/happykejie/PythonAlgthrom.git

# 备战面试，练练手
git clone https://github.com/lai-bluejay/ml_scratch.git

# 面试资源，包括准备面试的资料，面试题目，复习用的代码等
git clone https://github.com/ACMoretxj/Interview.git

# Python面试习题合集
git clone https://github.com/Fuzzy-Body/interview.git

# 3道面试题2018c版
git clone https://github.com/besiegesong/audition-topic.git

# 常见小面试题
git clone https://github.com/9527q/itv.git

# 面试  基础 算法
git clone https://github.com/murphywuwu/interview.git

# web界面测试模板
git clone https://github.com/royan-deng/web_ui_unittest.git

# 页面自动化测试
git clone https://github.com/q16797685/browser_auto.git

# 各种面试编程题
git clone https://github.com/mowen0107/interview.git

# 面试常考算法
git clone https://github.com/ycX1ong/Algorithm.git

# 面试算法汇总
git clone https://github.com/scopier/interview.git

# 面试问题练习
git clone https://github.com/lxh1121/data_exsiec.git

# 大厂的面试题
git clone https://github.com/Michaelxwb/Interview-questions.git

# web界面测试模板
git clone https://github.com/royan-deng/web_ui_unittest.git

# 页面自动化测试
git clone https://github.com/q16797685/browser_auto.git

# 测试web登录界面
git clone https://github.com/jenkin233/WebLoginTest.git

# Python 面试算法大全
git clone https://github.com/rieuse/Programmer-Algorithm-Interview-2019.git

# python 微软面试100题
git clone https://github.com/holisound/python-ms100.git

# 面试题第三题
git clone https://github.com/Aimoy/requestion.git

# 总结面试，笔试过程中遇到的编程题。
git clone https://github.com/aiminsu/interview.git

# 页面接口自动化测试
git clone https://github.com/q16797685/urlapi_autotest.git

# 某一家公司面试题
git clone https://github.com/BlueseSky/CSV_to_JSOn.git

# 随机创建用户名的面试
git clone https://github.com/hl294290116/create_username.git

# 生成测试数据，前端页面
git clone https://github.com/xuxs17/gendata.git

# 牛客网面试题下载
git clone https://github.com/wyt930927/NkInterviewQuestions.git

# 剑指offer面试题python实现
git clone https://github.com/liuzz07/seize-offers.git

# 《剑指Offer》面试题Python实现
git clone https://github.com/PandoraLS/CodingInterview.git

# Python开发常见面试题
git clone https://github.com/hj24/interview.git

# 腾讯面试50题刷题计划
git clone https://github.com/Binary2355/LeetCode-.git

# 实验楼里面的测试
git clone https://github.com/zybiscool/shiyanlou_code.git

# 面试中遇到的问题
git clone https://github.com/LuffySir/Interview-Question.git

# Algorithm problems 常见算法及面试题
git clone https://github.com/renpengcheng-github/Algorithm.git

# 一个面试问答网站
git clone https://github.com/wuzuxiaofendui/InterviewHelper.git

# 面试常问算法python实现
git clone https://github.com/cGitHub123/basic-Algorithm-python.git

# 面试遇到的趣味算法题
git clone https://github.com/pythonob/Arena.git

# 来源于京东面试题
git clone https://github.com/jinlukang1/information_extraction.git

# 程序员代码面试指南
git clone https://github.com/Zidoing/programer_interview_guide.git

# 页面自动化测试代码
git clone https://github.com/974744840/HTML-Test.git

# 《剑指Offer》面试题: Python实现
git clone https://github.com/khlee12/python-offer.git

# 记录一些刷过的面试题
git clone https://github.com/Annihilater/interview.git

# 矩阵未来，面试解答
git clone https://github.com/ZhangzhiS/flask_restful_api.git

# 数据库调试 web界面
git clone https://github.com/niu2x/mysql-web.git

# python 基础-进阶-应用-面试
git clone https://github.com/guozeping/Learn-Python.git

# 矩阵未来，面试解答
git clone https://github.com/ZhangzhiS/flask_restful_api.git

# 面试的时候刷一刷
git clone https://github.com/adbibo/python_interview.git

# 为面试而写的投票系统
git clone https://github.com/xfmo/vote_for_audition.git

# 经典面试题---FIzzBuzz项目
git clone https://github.com/JetHong/FizzBuzz.git

# 关于Python的面试题案例
git clone https://github.com/haha479/Interview_questions.git

# 想面试python后端开发
git clone https://github.com/dgzz/juzhenweilai.git

# 程序员代码面试指南  Python
git clone https://github.com/lofues/programer_code_interview_guide.git

# 我的面试经验总结
git clone https://github.com/Mr-YYM/my_interview.git

# 刷面试题啦，我要找工作~！！！
git clone https://github.com/jeferwang/InterviewQuestion.git

# Python求职面试经验宝典
git clone https://github.com/yuzhouStayHungry/cracking-the-python-interview.git

# 面试或者看到的题目
git clone https://github.com/DiroKate/collections.git

# 面试遇到的趣味算法题
git clone https://github.com/pythonob/Arena.git

# 来源于京东面试题
git clone https://github.com/jinlukang1/information_extraction.git

# 程序员代码面试指南
git clone https://github.com/Zidoing/programer_interview_guide.git

# 汇总这一路以来的笔试题和面试题
git clone https://github.com/Dengshunge/interview.git

# 算法及面试题---持续更新
git clone https://github.com/wangtianyu1995/My-algorithm-and-the-interview-questions.git

# 场量科技面试申请题
git clone https://github.com/onlycyf/interview.git

# python面试的题目总结
git clone https://github.com/beautiful523/Interview-questions.git

# 电子科技大学面试题目
git clone https://github.com/aoba98/particle_filter.git

# python程序员面试算法宝典
git clone https://github.com/ShadowZwx/python_algorithm.git

# Python3面试和网上笔试必备的知识，必须掌握！！
git clone https://github.com/Harrdy2018/Interview-Questions-Set.git

# 通过页面执行自动化测试脚本并查看测试结果
git clone https://github.com/Hardworking-tester/auto_test.git

# 项目的python自动化测试代码（面向对象）
git clone https://github.com/caojingwoaini/rcTest_python.git

# ML/NLP算法及相关面试准备
git clone https://github.com/BraveheartHui/NLP-Algorithm-Notes.git

# 程序员面试代码指南-python版
git clone https://github.com/hulu888/CodingInterviewGuide-python.git

# 剑指Offer——名企面试官精讲典型编程题
git clone https://github.com/Yiif4n/CodingInterviews.git

# 算法/深度学习/NLP面试笔记
git clone https://github.com/jtzhpf/Algorithm_Interview_Notes-Chinese.git

# python programmer interview book--python程序员面试宝典练习代码
git clone https://github.com/fqy-web/pythoninterview.git

# Python系统开发工程师面试申请题
git clone https://github.com/kingjxlove/interview.git

# app自动化面试问题课程学习
git clone https://github.com/wawj901124/mswt.git

# Python系统开发工程师面试申请题
git clone https://github.com/kingjxlove/interview.git

# app自动化面试问题课程学习
git clone https://github.com/wawj901124/mswt.git

# 面试题~也就作为今天的成果好了
git clone https://github.com/Linkeer365/cuhkTitleFetch.git

# 《程序员面试金典》书中代码实现
git clone https://github.com/himichael/Cracking_the_Coding_Interview.git

# 自动化测试用例web管理页面
git clone https://github.com/hehe0001/testcase_web.git

# 部署docker应用到aws上面，travis自动测试部署
git clone https://github.com/Jayden-Liang/docker-travis-aws.git

# senseyun 平台 页面自动化测试代码
git clone https://github.com/jinpingguo415/senseyun1.git

# 测试不同库解析HTML页面的速度差异
git clone https://github.com/Oslomayor/Crawler-DifferentLib-TimeTest.git

# 用来抽取面试题记忆的系统
git clone https://github.com/EvildoerHang/InterestingBack.git

# 记录一次面试遇到的编程题目
git clone https://github.com/xyw1042971947/mianshiblog.git

# 收集一些面试的编程题目
git clone https://github.com/ljzhangi/interview.git

# 剑指offer/算法与数据结构面试
git clone https://github.com/Sally66/-offer.git

# 各种面试中遇到的编程题
git clone https://github.com/toanoyx/interviewCode.git

# 程序员代码面试指南习题
git clone https://github.com/YQ-7/CodeInterviewGuide.git

# 基于PyQt5开发的桌面端口测试工具
git clone https://github.com/Pingze-github/pyRequest.git

# 爬虫，准备爬取看准的面试题目
git clone https://github.com/tyrantqiao/wormer.git

# 《剑指offer》《程序员面试经典》with python
git clone https://github.com/oscarhscc/algorithm-with-python.git

# Udacity技术面试练习-算法与数据结构
git clone https://github.com/muyanbiao/technical_interview.git

# 存储Python学习中遇到问题和面试素材
git clone https://github.com/xiong-zh/python_interview.git

# 最近Python面试经常问到的线程、进程方面的知识（代码）
git clone https://github.com/RookieBaby/threading-process.git

# 求职面试，算法刷题，python3, 参照《技术面试必备基础知识 CyC2018》,使用Python3完成其中leetcode部分。
git clone https://github.com/JeriYang/lettcodeExercise.git

# web页面UI自动化测试之关键字驱动测试--基于selenium工具python实现【python2.7】
git clone https://github.com/gitgogo/KeywordFramework.git

# i所谓的面试不一定是面试是时候一定要用的东西，他也是一种自我询问的情景，所以常做面试题可以让自己多知道自己的不足
git clone https://github.com/wang935415150/mianshiti.git

# 面试/算法/数据结构/leetcode 题解等经典算法实现笔记
git clone https://github.com/Liyafeng/awesome-algorithm.git

# 记录各种常用组件的学习笔记,面试宝典.
git clone https://github.com/yxzoro/onepiece.git

# 可怕的刷题集，呜呜，为什么面试要考这个。。。
git clone https://github.com/AmberHsia94/Scary_Leetcode.git

# 通过TK完成串口调试助手的界面的开发
git clone https://github.com/yanjun3x/tk_gui.git

# 牛客网-直通BAT面试算法精讲课习题代码
git clone https://github.com/RonaldZhao/NowCoder.git

# 剑指Offer的Python实现以及一些面试遇到的算法题
git clone https://github.com/minning/TargetOffer.git

# 编程能力练习合集（包含PAT、LeetCode、各公司面试题目）
git clone https://github.com/zhangpeng96/Programming-Ability-Practice.git

# 为面试做准备，每日一练，保证一天至少一个算法
git clone https://github.com/grainw/interview_code.git

# 天津大学2020年BIOMOD第一次面试现场题目抽选
git clone https://github.com/Adijnnuuy/tju_biomod_questions.git

# 剑指offer,leetcode,经典排序算法，面试算法题，python实现
git clone https://github.com/IronE-G-G/algorithm.git

# 使用selenium+unittest实现JD 登录UI页面的自动化测试
git clone https://github.com/LeonardoMrK/JD_loginUI_test.git

# 尝试做一个面向对象的“特工”--天马行空-纯粹练习
git clone https://github.com/headB/james_bound.git

# 左程云《程序员代码面试指南》编程题的Python实现
git clone https://github.com/sunjunee/Coding-Interview-Guide.git

# 面试时别要求做的工程题目,我的一些做法
git clone https://github.com/NothinkingGao/walkingjob.git

# 面试/算法/数据结构/leetcode 题解等经典算法实现笔记
git clone https://github.com/imttx/awesome-algorithm.git

# 一款面向 HTTP(S) 协议的通用测试框架，只需编写维护一份 YAML/JSON 脚本，即可实现自动化测试、性能测试、线上监控、持续集成等多种测试需求。
git clone https://github.com/testervic/HttpRunner.git

# 左程云 程序员代码面试指南 部分题的Python实现以及对应的Pytest测试代码
git clone https://github.com/dianshu/algorithm.git

# 仅仅作为测试用的，里面只有1到2个文件，并且代码都很简单。
git clone https://github.com/x8335533/teststore.git

# 《python程序员面试算法宝典》代码或自己优化后的代码
git clone https://github.com/xSandie/python_data_structure.git

# 基于Django， RESTful api，react， postgreSQL  实现的todolist小Demo。九章算法的实习面试题。
git clone https://github.com/JunYuanHub/todolist.git

# 《Python 面向对象编程指南》[Steven F.Lott] 著 ，学习笔记及案例测试
git clone https://github.com/sdzr/python_object_oriented.git

# 《剑指Offer——名企面试官精讲典型编程题》书中题目的Python实现
git clone https://github.com/chaibo/code_interviews_python.git

# 这是一个房天下的通用式爬虫,今天上传是为了作为面试材料.
git clone https://github.com/a371057600/FangSpider.git

# 无界面超星刷课脚本，看视频+章节测试全自动，不用打开浏览器挂着
git clone https://github.com/Luoofan/autochaoxing.git

# 最新的接口自动化代码，可以把测试的结果回填到excel里面
git clone https://github.com/Leihj/newest-code-api.git

# 李航《统计学习方法》笔记，刘宇波玩转算法面试笔记
git clone https://github.com/WQAQs/stydy-notes.git

# 利用自动化测试工具selenium和无界面浏览器phantomjs爬取拉钩网数据
git clone https://github.com/lixue323/selenium-phantomjs.git

# 各种比较有意思的面试题，算法题的解题方法或实现
git clone https://github.com/DesignerVictor/algorithm_demo.git

# 这里面的数据是随意选取的，意在测试相关的程序。
git clone https://github.com/tomeasure/a_test_for_a_python_question.git

# 2017年中兴捧月比赛，阿尔法勒克斯特组，面部识别，第一次尝试
git clone https://github.com/MrChengmo/ZTE_facial_detection_version1.git

# 牛客网www.nowcoder.com讨论区所有"笔试面经"类别的文章列表
git clone https://github.com/lszero/nowcoder_spider.git

# 初次练手，试着爬取mebook上面书籍的百度网盘和验证码，后续再做修改
git clone https://github.com/njsunjunjie/Crawl-mebook.git

# helloworld入门程序、连接数据库、异常处理、访问jsp页面、利用Mock API模拟Http请求测试后端代码
git clone https://github.com/Candice0001/MySpringBoot.git

# 利用面向对象的思想，尝试写一个五子棋小游戏。主要用到第三方库pygame。
git clone https://github.com/Magicyss/Five-in-a-row.git

# adb打开支付宝与点击、选择操作，后续测试appium，用页面元素的方式来点击
git clone https://github.com/lllwqqq/android.git

# Python(3.6.5)写的http Server, 响应POST, GET。可以在里面加delay. 可以配合postman和https那个项目测试
git clone https://github.com/zhouchong/httpServerPython.git

# Scrapyd 自带的后台管理页面功能太简单，无法满足业务需求，自己尝试性的写一个
git clone https://github.com/TomPyer/ScrapydManagement.git

# 该项目是为了找工作所创建的项目，主要是刷题，同时会更新一些面试的基础和实战题目。
git clone https://github.com/HarryinGit3/myleetcode.git

# :robot: 找工作的过程中写的一些便利的脚本工具，安心准备面试不必泡在招聘网站上
git clone https://github.com/codinglikepoetry/FindJobs.git

# Maticv是一个使用“视觉图像匹配”方法来自动化图形用户界面（GUI）的自动化测试框架。
git clone https://github.com/quentin-xia/Maticv.git

# 本项目用来进行大数据方面的尝试及大数据组件的尝试，方便开展后续的工作及记录生活的点滴
git clone https://github.com/zilaiye/bigdata.git

# 为了帮助朋友更好的准备军队文职面试，达到知己知彼，通过遍历对手的查询编号从而查询到对手的成绩，虽然是一种比较笨的方式，但是也还是行得通的
git clone https://github.com/baicaisir/DAC-result-senquiry.git

# webdrivermanager库国内版。 webdrivermanager是一个用于界面自动化测试时，浏览器驱动管理的开源库，该库的源码可以在github上获取。但是，在原库在使用时，无法下载谷歌驱动。我的这个，修改了这个功能，支持下载谷歌驱动
git clone https://github.com/lemonallen/webdrivermanager_zh.git

# 《大数据挖掘技术》课程项目，试图从搜狗实验室用户查询日志数据（2008）中找出搜索记录中有较高支持度关键词的频繁二项集。在实现层面上，我搭建了一个由五台服务器组成的微型 Hadoop 集群，并且用 Python 实现了 Parallel FP-Growth 算法中的三个 MapReduce 过程。
git clone https://github.com/CLDXiang/Mining-Frequent-Pattern-from-Search-History.git

# 2019年最新总结，阿里，腾讯，百度，美团，头条等技术面试题目，以及答案，专家出题人分析汇总。
git clone https://github.com/0voice/interview_internal_reference.git

# 中英文敏感词、语言检测、中外手机/电话归属地/运营商查询、名字推断性别、手机号抽取、身份证抽取、邮箱抽取、中日文人名库、中文缩写库、拆字词典、词汇情感值、停用词、反动词表、暴恐词表、繁简体转换、英文模拟中文发音、汪峰歌词生成器、职业名称词库、同义词库、反义词库、否定词库、汽车品牌词库、汽车零件词库、连续英文切割、各种中文词向量、公司名字大全、古诗词库、IT词库、财经词库、成语词库、地名词库、历史名人词库、诗词词库、医学词库、饮食词库、法律词库、汽车词库、动物词库、中文聊天语料、中文谣言数据、百度中文问答数据集、句子相似度匹配算法集合、bert资源、文本生成&摘要相关工具、cocoNLP信息抽取工具、国内电话号码正则匹配、清华大学XLORE:中英文跨语言百科知识图谱、清华大学人工智能技术系列报告、自然语言生成、NLU太难了系列、自动对联数据及机器人、用户名黑名单列表、罪名法务名词及分类模型、微信公众号语料、cs224n深度学习自然语言处理课程、中文手写汉字识别、中文自然语言处理 语料/数据集、变量命名神器、分词语料库+代码、任务型对话英文数据集、ASR 语音数据集 + 基于深度学习的中文语音识别系统、笑声检测器、Microsoft多语言数字/单位/如日期时间识别包、中华新华字典数据库及api(包括常用歇后语、成语、词语和汉字)、文档图谱自动生成、SpaCy 中文模型、Common Voice语音识别数据集新版、神经网络关系抽取、基于bert的命名实体识别、关键词(Keyphrase)抽取包pke、基于医疗领域知识图谱的问答系统、基于依存句法与语义角色标注的事件三元组抽取、依存句法分析4万句高质量标注数据、cnocr：用来做中文OCR的Python3包、中文人物关系知识图谱项目、中文nlp竞赛项目及代码汇总、中文字符数据、speech-aligner: 从“人声语音”及其“语言文本”产生音素级别时间对齐标注的工具、AmpliGraph: 知识图谱表示学习(Python)库：知识图谱概念链接预测、Scattertext 文本可视化(python)、语言/知识表示工具：BERT & ERNIE、中文对比英文自然语言处理NLP的区别综述、Synonyms中文近义词工具包、HarvestText领域自适应文本挖掘工具（新词发现-情感分析-实体链接等）、word2word：(Python)方便易用的多语言词-词对集：62种语言/3,564个多语言对、语音识别语料生成工具：从具有音频/字幕的在线视频创建自动语音识别(ASR)语料库、构建医疗实体识别的模型（包含词典和语料标注）、单文档非监督的关键词抽取、Kashgari中使用gpt-2语言模型、开源的金融投资数据提取工具、文本自动摘要库TextTeaser: 仅支持英文、人民日报语料处理工具集、一些关于自然语言的基本模型、基于14W歌曲知识库的问答尝试--功能包括歌词接龙and已知歌词找歌曲以及歌曲歌手歌词三角关系的问答、基于Siamese bilstm模型的相似句子判定模型并提供训练数据集和测试数据集、用Transformer编解码模型实现的根据Hacker News文章标题自动生成评论、用BERT进行序列标记和文本分类的模板代码、LitBank：NLP数据集——支持自然语言处理和计算人文学科任务的100部带标记英文小说语料、百度开源的基准信息抽取系统、虚假新闻数据集、Facebook: LAMA语言模型分析，提供Transformer-XL/BERT/ELMo/GPT预训练语言模型的统一访问接口、CommonsenseQA：面向常识的英文QA挑战、中文知识图谱资料、数据及工具、各大公司内部里大牛分享的技术文档 PDF 或者 PPT、自然语言生成SQL语句（英文）、中文NLP数据增强（EDA）工具、英文NLP数据增强工具 、基于医药知识图谱的智能问答系统、京东商品知识图谱、基于mongodb存储的军事领域知识图谱问答项目、基于远监督的中文关系抽取、语音情感分析、中文ULMFiT-情感分析-文本分类-语料及模型、一个拍照做题程序、世界各国大规模人名库、一个利用有趣中文语料库 qingyun 训练出来的中文聊天机器人、中文聊天机器人seqGAN、省市区镇行政区划数据带拼音标注、教育行业新闻语料库包含自动文摘功能、开放了对话机器人-知识图谱-语义理解-自然语言处理工具及数据、中文知识图谱：基于百度百科中文页面-抽取三元组信息-构建中文知识图谱、masr: 中文语音识别-提供预训练模型-高识别率、Python音频数据增广库、中文全词覆盖BERT及两份阅读理解数据、ConvLab：开源多域端到端对话系统平台、中文自然语言处理数据集、基于最新版本rasa搭建的对话系统、基于TensorFlow和BERT的管道式实体及关系抽取、一个小型的证券知识图谱/知识库、复盘所有NLP比赛的TOP方案、OpenCLaP：多领域开源中文预训练语言模型仓库、UER：基于不同语料+编码器+目标任务的中文预训练模型仓库、中文自然语言处理向量合集、基于金融-司法领域(兼有闲聊性质)的聊天机器人、g2pC：基于上下文的汉语读音自动标记模块、Zincbase 知识图谱构建工具包、诗歌质量评价/细粒度情感诗歌语料库、快速转化「中文数字」和「阿拉伯数字」、百度知道问答语料库、基于知识图谱的问答系统、jieba_fast 加速版的jieba、正则表达式教程、中文阅读理解数据集、基于BERT等最新语言模型的抽取式摘要提取、Python利用深度学习进行文本摘要的综合指南、知识图谱深度学习相关资料整理、维基大规模平行文本语料、StanfordNLP 0.2.0：纯Python版自然语言处理包、NeuralNLP-NeuralClassifier：腾讯开源深度学习文本分类工具、端到端的封闭域对话系统、中文命名实体识别：NeuroNER vs. BertNER、新闻事件线索抽取、2019年百度的三元组抽取比赛：“科学空间队”源码、基于依存句法的开放域文本知识三元组抽取和知识库构建、中文的GPT2训练代码、ML-NLP - 机器学习(Machine Learning)NLP面试中常考到的知识点和代码实现、nlp4han:中文自然语言处理工具集(断句/分词/词性标注/组块/句法分析/语义分析/NER/N元语法/HMM/代词消解/情感分析/拼写检查、XLM：Facebook的跨语言预训练语言模型、用基于BERT的微调和特征提取方法来进行知识图谱百度百科人物词条属性抽取、中文自然语言处理相关的开放任务-数据集-当前最佳结果、CoupletAI - 基于CNN+Bi-LSTM+Attention 的自动对对联系统、抽象知识图谱、MiningZhiDaoQACorpus - 580万百度知道问答数据挖掘项目、brat rapid annotation tool: 序列标注工具、大规模中文知识图谱数据：1.4亿实体、数据增强在机器翻译及其他nlp任务中的应用及效果、allennlp阅读理解:支持多种数据和模型、PDF表格数据提取工具 、 Graphbrain：AI开源软件库和科研工具，目的是促进自动意义提取和文本理解以及知识的探索和推断、简历自动筛选系统、基于命名实体识别的简历自动摘要、中文语言理解测评基准，包括代表性的数据集&基准模型&语料库&排行榜、树洞 OCR 文字识别 、从包含表格的扫描图片中识别表格和文字、语声迁移、Python口语自然语言处理工具集(英文)、 similarity：相似度计算工具包，java编写、海量中文预训练ALBERT模型 、Transformers 2.0 、基于大规模音频数据集Audioset的音频增强 、Poplar：网页版自然语言标注工具、图片文字去除，可用于漫画翻译 、186种语言的数字叫法库、Amazon发布基于知识的人-人开放领域对话数据集 、中文文本纠错模块代码、繁简体转换 、 Python实现的多种文本可读性评价指标、类似于人名/地名/组织机构名的命名体识别数据集 、东南大学《知识图谱》研究生课程(资料)、. 英文拼写检查库 、 wwsearch是企业微信后台自研的全文检索引擎、CHAMELEON：深度学习新闻推荐系统元架构 、 8篇论文梳理BERT相关模型进展与反思、DocSearch：免费文档搜索引擎、 LIDA：轻量交互式对话标注工具 、aili - the fastest in-memory index in the East 东半球最快并发索引 、知识图谱车音工作项目、自然语言生成资源大全 、中日韩分词库mecab的Python接口库、中文文本摘要/关键词提取、汉字字符特征提取器 (featurizer)，提取汉字的特征（发音特征、字形特征）用做深度学习的特征、中文生成任务基准测评 、中文缩写数据集、中文任务基准测评 - 代表性的数据集-基准(预训练)模型-语料库-baseline-工具包-排行榜、PySS3：面向可解释AI的SS3文本分类器机器可视化工具 、中文NLP数据集列表、COPE - 格律诗编辑程序、doccano：基于网页的开源协同多语言文本标注工具 、PreNLP：自然语言预处理库、简单的简历解析器，用来从简历中提取关键信息、用于中文闲聊的GPT2模型：GPT2-chitchat、基于检索聊天机器人多轮响应选择相关资源列表(Leaderboards、Datasets、Papers)、(Colab)抽象文本摘要实现集锦(教程 、词语拼音数据、高效模糊搜索工具、NLP数据增广资源集、微软对话机器人框架 、 GitHub Typo Corpus：大规模GitHub多语言拼写错误/语法错误数据集、TextCluster：短文本聚类预处理模块 Short text cluster、面向语音识别的中文文本规范化、BLINK：最先进的实体链接库、BertPunc：基于BERT的最先进标点修复模型、Tokenizer：快速、可定制的文本词条化库、中文语言理解测评基准，包括代表性的数据集、基准(预训练)模型、语料库、排行榜、spaCy 医学文本挖掘与信息提取 、 NLP任务示例项目代码集、 python拼写检查库、chatbot-list - 行业内关于智能客服、聊天机器人的应用和架构、算法分享和介绍、语音质量评价指标(MOSNet, BSSEval, STOI, PESQ, SRMR)、 用138GB语料训练的法文RoBERTa预训练语言模型 、BERT-NER-Pytorch：三种不同模式的BERT中文NER实验、无道词典 - 有道词典的命令行版本，支持英汉互查和在线查询、2019年NLP亮点回顾、 Chinese medical dialogue data 中文医疗对话数据集 、最好的汉字数字(中文数字)-阿拉伯数字转换工具、 基于百科知识库的中文词语多词义/义项获取与特定句子词语语义消歧、awesome-nlp-sentiment-analysis - 情感分析、情绪原因识别、评价对象和评价词抽取、LineFlow：面向所有深度学习框架的NLP数据高效加载器、中文医学NLP公开资源整理 、MedQuAD：(英文)医学问答数据集、将自然语言数字串解析转换为整数和浮点数、Transfer Learning in Natural Language Processing (NLP) 、面向语音识别的中文/英文发音辞典、Tokenizers：注重性能与多功能性的最先进分词器、CLUENER 细粒度命名实体识别 Fine Grained Named Entity Recognition、 基于BERT的中文命名实体识别、中文谣言数据库、NLP数据集/基准任务大列表、nlp相关的一些论文及代码, 包括主题模型、词向量(Word Embedding)、命名实体识别(NER)、文本分类(Text Classificatin)、文本生成(Text Generation)、文本相似性(Text Similarity)计算等，涉及到各种与nlp相关的算法，基于keras和tensorflow 、Python文本挖掘/NLP实战示例、 Blackstone：面向非结构化法律文本的spaCy pipeline和NLP模型通过同义词替换实现文本“变脸” 、中文 预训练 ELECTREA 模型: 基于对抗学习 pretrain Chinese Model 、albert-chinese-ner - 用预训练语言模型ALBERT做中文NER 、基于GPT2的特定主题文本生成/文本增广、开源预训练语言模型合集、多语言句向量包、编码、标记和实现：一种可控高效的文本生成方法、 英文脏话大列表 、attnvis：GPT2、BERT等transformer语言模型注意力交互可视化、CoVoST：Facebook发布的多语种语音-文本翻译语料库，包括11种语言(法语、德语、荷兰语、俄语、西班牙语、意大利语、土耳其语、波斯语、瑞典语、蒙古语和中文)的语音、文字转录及英文译文、Jiagu自然语言处理工具 - 以BiLSTM等模型为基础，提供知识图谱关系抽取 中文分词 词性标注 命名实体识别 情感分析 新词发现 关键词 文本摘要 文本聚类等功能、用unet实现对文档表格的自动检测，表格重建、NLP事件提取文献资源列表 、 金融领域自然语言处理研究资源大列表、CLUEDatasetSearch - 中英文NLP数据集：搜索所有中文NLP数据集，附常用英文NLP数据集 、medical_NER - 中文医学知识图谱命名实体识别 、(哈佛)讲因果推理的免费书、知识图谱相关学习资料/数据集/工具资源大列表、Forte：灵活强大的自然语言处理pipeline工具集 、Python字符串相似性算法库、PyLaia：面向手写文档分析的深度学习工具包、TextFooler：针对文本分类/推理的对抗文本生成模块、Haystack：灵活、强大的可扩展问答(QA)框架、中文关键短语抽取工具
git clone https://github.com/fighting41love/funNLP.git

# 面试题
git clone https://github.com/leeguandong/Interview-code-practice-python.git

# 《剑指Offer》面试题Python实现
git clone https://github.com/JushuangQiao/Python-Offer.git

# 2018/2019/校招/春招/秋招/自然语言处理(NLP)/深度学习(Deep Learning)/机器学习(Machine Learning)/C/C++/Python/面试笔记，此外，还包括创建者看到的所有机器学习/深度学习面经中的问题。 除了其中 DL/ML 相关的，其他与算法岗相关的计算机知识也会记录。 但是不会包括如前端/测试/JAVA/Android等岗位中有关的问题。
git clone https://github.com/DarLiner/Algorithm_Interview_Notes-Chinese.git

# Leetcode、剑指Offer——名企面试官精讲典型编程题
git clone https://github.com/nlpjoe/Coding4Interviews.git

# 面试总结
git clone https://github.com/sushengbuhuo/php-interview-2018.git

# 互联网行业研发岗面试必备算法题配图解析及代码
git clone https://github.com/DmrfCoder/AlgorithmAndDataStructure.git

# 工程师的自我修养 -> 从 linux , 网络，MQ, Rpc, 缓存, 高可用架构，数据库，语言，全方位成长，成为技术大神，优秀的工程师 , readme 包括蚂蚁, 头条, 美团等面试思考( 拿下 offer)
git clone https://github.com/yuhaqiang123/my-love.git

# 基于 python 的 selenium UI 自动化测试框架，采用 Page Object 设计模式进行二次开发，通过对页面对象和测试代码进行分离，并封装了日志输出，浏览器引擎选择，二次封装常用方法。降低后期因页面变化带来的维护成本，减少了代码的重复，提高测试用例的可读性
git clone https://github.com/StrawberryFlavor/Selenium-Framework.git

# 针对常见的BAT公司中的大数据面试和笔试问题，列出解决思路，并使用python来实现
git clone https://github.com/yoghurtjia/-python-BAT-.git

# 这个是自己日常改写和积累的python资料：本次资料提供大量的python面试的准备资料，包括常用的python版本代码段、python网络编程的各个部分的实现方式、python版本的设计模式、以及最最会考的令人头痛的算法问题（python版本）
git clone https://github.com/imtiantian/Python_Awesome_Interview.git

# Just  Code ! 针对面试训练算法题， 目前包括字节跳动面试题、 LeetCode 和剑指 offer ，持续扩容中 :star:
git clone https://github.com/YaxeZhang/Just-Code.git

# 经典算法&面试题的源代码实现项目
git clone https://github.com/wuchong/Algorithm-Interview.git

# python 数据结构 算法 LeetCode 牛客 面试 编程之美 动态规划 字典树 快速排序 树 字符串 数组 链表 全排列 堆排序 位运算 大数相加
git clone https://github.com/whtlkeep/BAT-algorithms.git

# 整理自己准备面试时的相关资料，包括 GitBook、Python、C/C++ 等代码及知识点
git clone https://github.com/L1nwatch/interview_collect.git

# 面试常见问题总结
git clone https://github.com/LEAGUE-OF-BME/InterviewFAQ.git

# 基于Selenium+unittest的WebUI自动化测试框架，使用POM(页面对象模型)设计模式，适合几乎所有web项目，可集成Jenkins部署自动化测试
git clone https://github.com/G2Bent/Vantpy.git

# 后端面试题汇总（Python、Redis、MySQL、PostgreSQL、Kafka、数据结构、算法、编程、网络）
git clone https://github.com/yongxinz/back-end-interview.git

# 面试准备
git clone https://github.com/IcyCC/effective_note.git

# LeetCode Java Algorithm 记录数据结构与算法训练题，分享java面试题
git clone https://github.com/geektutu/leetcode-java.git

# 此项目是《剑指offer》第二版里算法面试题的Python3实现版本，作为一本经典书籍，可以时常拿出来看一看、翻一翻、记一记。同时也是为了Python程序员能够更好的通过公司的技术面试，拿到心仪的offer。
git clone https://github.com/NLP-LOVE/CodingInterviews2-ByPython.git

# 一个微信图形界面调试工具，免去你将程序部署到服务器的麻烦。
git clone https://github.com/winkidney/wei-dev.git

# This repo is the sample code of online vedio class “高频算法面试精讲”
git clone https://github.com/chlxydl/Algorithm_Class_Problem_Sample_Code.git

# 双目立体视觉是计算机视觉范畴的核心之一，它利用双目相机来获得目标物体的图像，经过物体图像处理 之后得到目标物体所在场景环境的三维信息，最终实现非接触条件下测距，简单便捷。本次毕业设计主要内容为研究 基于双目立体视觉平台上的图像匹配以及目标物体的距离测量技术，图像特征提取部分研究了 SIFT 算法和 SURF 算 法，特征匹配部分研究了 BF 法和 FLANN 法，距离测量研究主要通过视差深度的计算，结合视觉坐标系的转换实现 三维位置的定位与测量。结合维视双目立体视觉测量平台 MV-VS220，通过 Python+OpenCV 设计实现一个具备图像 采集、图像匹配以及距离测量等功能的原型演示系统。系统可实现对关键环节的过程与结果的演示，以及不同算法的 性能比较。系统测试表明，所开发的原型演示系统从界面、功能与性能方面均达到了设计的要求。
git clone https://github.com/Cuirongcheng/Image-matching-and-ranging-based-on-binocular-stereo-vision.git

# 定位综述 目前用于人脸定位的有两种主流方法，一种是基于级联形状回归模型，另一种就是基于深度学习的方法。级联形状回归方法就是使用回归模型，直接学习从人脸表征到人脸形状的映射函数，进而建立从表观到形状的对应关系。这种方法的学习依赖于训练集的选取，如果训练集中包含了复杂的姿态变化，学习到的函数测试性能就会比较好。现有很多基于回归的方法，其中比较突出的有颜水成的DCR（Deep Cascaded Regression）、ESR（Explicitly Shape Regression）方法、LBF（Local Binary Features）方法以及SDM（Supervised Decent Method）方法。但是，上述方法也存在一定的问题，例如，基于提取到的局部图像特征来定位时很难找到具有全局信息的关键点。基于点分布模型的方法和基于形状回归的方法都很依赖于初始值，其中，初始值通常由训练集的平均形状来给定，如果初始值或者设定的平均形状远远偏离目标位置，很难收敛到正确位置。比如，训练集中大部分都是正脸，那么对于测试集中大偏转角度人脸图像的定位就比较困难。 于是引入深度学习来解决较大面部偏转姿态的回归问题，深度学习的最大的优点是有强大的表达能力，可以自学习图像的特征，不需要人为的寻找特征。目前用的基本网络有（1）级联方式：由粗到精一级一级的优化前一步得到的形状，比如香港中文大学汤晓鸥老师的研究团队采用深度卷积神经网络的3个级联结构，逐步细化特征点位置。（2）沙漏网络：密集堆叠连接的U-Nets来进行人脸关键点定位，如CU-Nets通过卷积-反卷积，下采样与上采样网络，跨越不同U-Nets进行全局梯度传播，融合多尺度特征，不断迭代优化关键点坐标。但是深度学习方法的缺点是模型过于复杂，参数非常多，耗时比较长。 深度学习的国内外方法优化：（1）最早的有将人脸进行五官分区域定位回归，但很容易使最终结果陷入局部最优值而不是全局最优。（2）heatmap热图的方法，对数据标签进行处理生成高斯热图，从而更好的回归关键点位置。（3）风格聚合方法，对数据集进行处理生成不同风格的图片，以应对复杂的真实环境如光照强弱。（4）基于边缘感知的人脸关键点检测算法，首先通过消息传递并结合对抗学习得到高精度的边缘线检测结果，再将边缘线信息融合到关键点检测中，来提升算法在大侧脸、夸张表情、遮挡、模糊等极端情况下的鲁棒性。（5）3D人脸模型方法，一种方式是结合3D人脸姿态估计与投影来确定特征点初始位置，然后使用经典的回归树集成ERT方法来更好的进行位置回归；另一种是直接从单幅人脸图像中同时回归出3D人脸结构和密集对齐点；该类方法通过回归位置图，来获得3D几何以及语义信息。（6）人脸特征点检测与形状拟合方法，基于“特征提取”+“回归坐标”的方法，把形状拟合的坐标回归问题，转化为坐标PCA压缩后系数与形状整体仿射变换系数的回归问题（相当于将传统的SDM算法用于深度学习算法当中）。 目前定位方法的改进是： 1.基于深度学习的方法：改进如下： （1）受人体关键点定位 难例挖掘方法的启发，在全局的globalnet之后继续对损失较大的点继续进行微调。 （2）并行集成的方式同时训练两个网络globalnet、refinenet，测试时，第一个网络输出的l2 loss 取top k  loss作为refinenet的辅助损失继续微调回归关键点位置。（在300w 有缺失块的数据集上最终的测试结果，平均定位误差为5.9%）  300-W数据库： 68点定位库，包含4个数据集，比如AFW，LFPW，HELLE，还包含135张IBUG里面的图片，IBUG图片对于定位来说都是非常具有挑战性的，不管是旋转角度还是遮挡程度都是非常大的。我们用HELEN的2000张，LFPW的811张，AFW的337张，总共3148张图片作为训练集。用HELEN的554张，IBUG的135张图片，总共689张图片作为测试集。一般测试集分为3个标准：简单，有挑战，全集。简单的测试集就是前面554张图片，有挑战的就是后面那135张图片，全集即689张图片。对三个测试集分别测试，得出测试结果，并与其它方法进行比较。测试标准为定位的平均误差，是被双瞳孔距离归一化后的，平均误差越低代表这一算法越好。
git clone https://github.com/1365843167/-.git

# 2018/2019/校招/春招/秋招/算法/机器学习(Machine Learning)/深度学习(Deep Learning)/自然语言处理(NLP)/C/C++/Python/面试笔记
git clone https://github.com/DiHiera/Algorithm_Interview_Notes-Chinese-master.git

# Python Web 开发面试过程中的知识点总结
git clone https://github.com/MorsoLi/python-interview-guide.git

# 《Python程序员面试算法宝典》配套代码
git clone https://github.com/Yasin6/Programmer-Algorithm-Interview.git

# 算法面试题用的，都是iMac里的内容
git clone https://github.com/sindwerra/Algorithms.git

